function pow(x,n) // отсутствует пробел между аргументами
{ // фигурная скобки должны быть в египетском стиле
  let result=1; // нет пробелов вокруг знака =
  for(let i=0;i<n;i++) {result*=x;} //пробелы вокруг операторов отсутствуют, всё слипшееся, то что в фигурны перенести на след 2 строки
  return result;
}

let x=prompt("x?",''), n=prompt("n?",'') // пробелов нет, точки с запятой, выглядит длинно и надо задумываться, 
//если бы в 2 строки написали не пришлось бы думать даже
if (n<=0) // пробелов нет
{ // фигурная скобки должны быть в египетском стиле
  alert(`Степень ${n} не поддерживается, введите целую степень, большую 0`);
}
else // должно быть } else {
{
  alert(pow(x,n)) // пробелы, точка с запятой
}